ckuzma/cypress-sensor-hub/PSoC Firmware/EnvironmentSensing.cydsn/Generated_Source/PSoC4/Rectifier_1_UABH_B_regs.h
#define Rectifier_1_UABH_B_SW_CA_IN0_ADDR                (Rectifier_1_UABH_B_halfuab__SW_CA_IN0)
#define Rectifier_1_UABH_B_SW_CA_IN0_PTR                ((reg32*)Rectifier_1_UABH_B_SW_CA_IN0_ADDR)
#define Rectifier_1_UABH_B_SW_CA_IN0_REG                (*(Rectifier_1_UABH_B_SW_CA_IN0_PTR))

#define Rectifier_1_UABH_B_SW_CA_IN1_ADDR                (Rectifier_1_UABH_B_halfuab__SW_CA_IN1)
#define Rectifier_1_UABH_B_SW_CA_IN1_PTR                ((reg32*)Rectifier_1_UABH_B_SW_CA_IN1_ADDR)
#define Rectifier_1_UABH_B_SW_CA_IN1_REG                (*(Rectifier_1_UABH_B_SW_CA_IN1_PTR))

#define Rectifier_1_UABH_B_SW_CA_TOP_ADDR                (Rectifier_1_UABH_B_halfuab__SW_CA_TOP)
#define Rectifier_1_UABH_B_SW_CA_TOP_PTR                ((reg32*)Rectifier_1_UABH_B_SW_CA_TOP_ADDR)
#define Rectifier_1_UABH_B_SW_CA_TOP_REG                (*(Rectifier_1_UABH_B_SW_CA_TOP_PTR))

#define Rectifier_1_UABH_B_SW_CB_IN0_ADDR                (Rectifier_1_UABH_B_halfuab__SW_CB_IN0)
#define Rectifier_1_UABH_B_SW_CB_IN0_PTR                ((reg32*)Rectifier_1_UABH_B_SW_CB_IN0_ADDR)
#define Rectifier_1_UABH_B_SW_CB_IN0_REG                (*(Rectifier_1_UABH_B_SW_CB_IN0_PTR))

#define Rectifier_1_UABH_B_SW_CB_IN1_ADDR                (Rectifier_1_UABH_B_halfuab__SW_CB_IN1)
#define Rectifier_1_UABH_B_SW_CB_IN1_PTR                ((reg32*)Rectifier_1_UABH_B_SW_CB_IN1_ADDR)
#define Rectifier_1_UABH_B_SW_CB_IN1_REG                (*(Rectifier_1_UABH_B_SW_CB_IN1_PTR))

#define Rectifier_1_UABH_B_SW_CB_TOP_ADDR                (Rectifier_1_UABH_B_halfuab__SW_CB_TOP)
#define Rectifier_1_UABH_B_SW_CB_TOP_PTR                ((reg32*)Rectifier_1_UABH_B_SW_CB_TOP_ADDR)
#define Rectifier_1_UABH_B_SW_CB_TOP_REG                (*(Rectifier_1_UABH_B_SW_CB_TOP_PTR))

#define Rectifier_1_UABH_B_SW_CC_IN0_ADDR                (Rectifier_1_UABH_B_halfuab__SW_CC_IN0)
#define Rectifier_1_UABH_B_SW_CC_IN0_PTR                ((reg32*)Rectifier_1_UABH_B_SW_CC_IN0_ADDR)
#define Rectifier_1_UABH_B_SW_CC_IN0_REG                (*(Rectifier_1_UABH_B_SW_CC_IN0_PTR))

#define Rectifier_1_UABH_B_SW_CC_IN1_ADDR                (Rectifier_1_UABH_B_halfuab__SW_CC_IN1)
#define Rectifier_1_UABH_B_SW_CC_IN1_PTR                ((reg32*)Rectifier_1_UABH_B_SW_CC_IN1_ADDR)
#define Rectifier_1_UABH_B_SW_CC_IN1_REG                (*(Rectifier_1_UABH_B_SW_CC_IN1_PTR))

#define Rectifier_1_UABH_B_SW_CC_TOP_ADDR                (Rectifier_1_UABH_B_halfuab__SW_CC_TOP)
#define Rectifier_1_UABH_B_SW_CC_TOP_PTR                ((reg32*)Rectifier_1_UABH_B_SW_CC_TOP_ADDR)
#define Rectifier_1_UABH_B_SW_CC_TOP_REG                (*(Rectifier_1_UABH_B_SW_CC_TOP_PTR))

#define Rectifier_1_UABH_B_SW_CF_BOT_ADDR                (Rectifier_1_UABH_B_halfuab__SW_CF_BOT)
#define Rectifier_1_UABH_B_SW_CF_BOT_PTR                ((reg32*)Rectifier_1_UABH_B_SW_CF_BOT_ADDR)
#define Rectifier_1_UABH_B_SW_CF_BOT_REG                (*(Rectifier_1_UABH_B_SW_CF_BOT_PTR))

#define Rectifier_1_UABH_B_SW_OTHER_ADDR                 (Rectifier_1_UABH_B_halfuab__SW_OTHER)
#define Rectifier_1_UABH_B_SW_OTHER_PTR                 ((reg32*)Rectifier_1_UABH_B_SW_OTHER_ADDR)
#define Rectifier_1_UABH_B_SW_OTHER_REG                 (*(Rectifier_1_UABH_B_SW_OTHER_PTR))

#define Rectifier_1_UABH_B_SW_BOOST_CTRL_ADDR            (Rectifier_1_UABH_B_halfuab__SW_BOOST_CTRL)
#define Rectifier_1_UABH_B_SW_BOOST_CTRL_PTR            ((reg32*)Rectifier_1_UABH_B_SW_BOOST_CTRL_ADDR)
#define Rectifier_1_UABH_B_SW_BOOST_CTRL_REG            (*(Rectifier_1_UABH_B_SW_BOOST_CTRL_PTR))

#define Rectifier_1_UABH_B_SRAM_CTRL_ADDR                (Rectifier_1_UABH_B_halfuab__SRAM_CTRL)
#define Rectifier_1_UABH_B_SRAM_CTRL_PTR                ((reg32*)Rectifier_1_UABH_B_SRAM_CTRL_ADDR)
#define Rectifier_1_UABH_B_SRAM_CTRL_REG                (*(Rectifier_1_UABH_B_SRAM_CTRL_PTR))

#define Rectifier_1_UABH_B_STAT_ADDR                     (Rectifier_1_UABH_B_halfuab__STAT)
#define Rectifier_1_UABH_B_STAT_PTR                     ((reg32*)Rectifier_1_UABH_B_STAT_ADDR)
#define Rectifier_1_UABH_B_STAT_REG                     (*(Rectifier_1_UABH_B_STAT_PTR))

#define Rectifier_1_UABH_B_SRAM0_ADDR                    (Rectifier_1_UABH_B_halfuab__SRAM0)
#define Rectifier_1_UABH_B_SRAM0_PTR                    ((reg32*)Rectifier_1_UABH_B_SRAM0_ADDR)
#define Rectifier_1_UABH_B_SRAM0_REG                    (*(Rectifier_1_UABH_B_SRAM0_PTR))

#define Rectifier_1_UABH_B_SRAM1_ADDR                    (Rectifier_1_UABH_B_halfuab__SRAM1)
#define Rectifier_1_UABH_B_SRAM1_PTR                    ((reg32*)Rectifier_1_UABH_B_SRAM1_ADDR)
#define Rectifier_1_UABH_B_SRAM1_REG                    (*(Rectifier_1_UABH_B_SRAM1_PTR))

#define Rectifier_1_UABH_B_SRAM2_ADDR                    (Rectifier_1_UABH_B_halfuab__SRAM2)
#define Rectifier_1_UABH_B_SRAM2_PTR                    ((reg32*)Rectifier_1_UABH_B_SRAM2_ADDR)
#define Rectifier_1_UABH_B_SRAM2_REG                    (*(Rectifier_1_UABH_B_SRAM2_PTR))

#define Rectifier_1_UABH_B_SRAM3_ADDR                    (Rectifier_1_UABH_B_halfuab__SRAM3)
#define Rectifier_1_UABH_B_SRAM3_PTR                    ((reg32*)Rectifier_1_UABH_B_SRAM3_ADDR)
#define Rectifier_1_UABH_B_SRAM3_REG                    (*(Rectifier_1_UABH_B_SRAM3_PTR))

#define Rectifier_1_UABH_B_SRAM4_ADDR                    (Rectifier_1_UABH_B_halfuab__SRAM4)
#define Rectifier_1_UABH_B_SRAM4_PTR                    ((reg32*)Rectifier_1_UABH_B_SRAM4_ADDR)
#define Rectifier_1_UABH_B_SRAM4_REG                    (*(Rectifier_1_UABH_B_SRAM4_PTR))

#define Rectifier_1_UABH_B_SRAM5_ADDR                    (Rectifier_1_UABH_B_halfuab__SRAM5)
#define Rectifier_1_UABH_B_SRAM5_PTR                    ((reg32*)Rectifier_1_UABH_B_SRAM5_ADDR)
#define Rectifier_1_UABH_B_SRAM5_REG                    (*(Rectifier_1_UABH_B_SRAM5_PTR))

#define Rectifier_1_UABH_B_SRAM6_ADDR                    (Rectifier_1_UABH_B_halfuab__SRAM6)
#define Rectifier_1_UABH_B_SRAM6_PTR                    ((reg32*)Rectifier_1_UABH_B_SRAM6_ADDR)
#define Rectifier_1_UABH_B_SRAM6_REG                    (*(Rectifier_1_UABH_B_SRAM6_PTR))

#define Rectifier_1_UABH_B_SRAM7_ADDR                    (Rectifier_1_UABH_B_halfuab__SRAM7)
#define Rectifier_1_UABH_B_SRAM7_PTR                    ((reg32*)Rectifier_1_UABH_B_SRAM7_ADDR)
#define Rectifier_1_UABH_B_SRAM7_REG                    (*(Rectifier_1_UABH_B_SRAM7_PTR))

#define Rectifier_1_UABH_B_SRAM8_ADDR                    (Rectifier_1_UABH_B_halfuab__SRAM8)
#define Rectifier_1_UABH_B_SRAM8_PTR                    ((reg32*)Rectifier_1_UABH_B_SRAM8_ADDR)
#define Rectifier_1_UABH_B_SRAM8_REG                    (*(Rectifier_1_UABH_B_SRAM8_PTR))

#define Rectifier_1_UABH_B_SRAM9_ADDR                    (Rectifier_1_UABH_B_halfuab__SRAM9)
#define Rectifier_1_UABH_B_SRAM9_PTR                    ((reg32*)Rectifier_1_UABH_B_SRAM9_ADDR)
#define Rectifier_1_UABH_B_SRAM9_REG                    (*(Rectifier_1_UABH_B_SRAM9_PTR))

#define Rectifier_1_UABH_B_SRAM10_ADDR                   (Rectifier_1_UABH_B_halfuab__SRAM10)
#define Rectifier_1_UABH_B_SRAM10_PTR                   ((reg32*)Rectifier_1_UABH_B_SRAM10_ADDR)
#define Rectifier_1_UABH_B_SRAM10_REG                   (*(Rectifier_1_UABH_B_SRAM10_PTR))

