ckuzma/cypress-sensor-hub/PSoC Firmware/EnvironmentSensing.cydsn/Generated_Source/PSoC4/Rectifier_1_UABH_B_regs.h
#define Rectifier_1_UABH_B_UAB_PWR_SHIFT                CyUAB_UAB_PWR_SHIFT
#define Rectifier_1_UABH_B_UAB_PWR_MASK                 (0x3UL<<Rectifier_1_UABH_B_UAB_PWR_SHIFT)
#define Rectifier_1_UABH_B_UAB_PWR_NORMAL               (0UL)
#define Rectifier_1_UABH_B_UAB_PWR_ULTRA_LOW            (1UL)
#define Rectifier_1_UABH_B_UAB_PWR_ULTRA_HIGH           (2UL)
#define Rectifier_1_UABH_B_UAB_PWR_Reserved             (3UL)


/*CAP_CTRL*/
#define Rectifier_1_UABH_B_CB_GND_SHIFT                 CyUAB_CB_GND_SHIFT
#define Rectifier_1_UABH_B_CB_GND_MASK                  (1UL<<Rectifier_1_UABH_B_CB_GND_SHIFT)

#define Rectifier_1_UABH_B_CC_GND_SHIFT                 CyUAB_CC_GND_SHIFT
#define Rectifier_1_UABH_B_CC_GND_MASK                  (1UL<<Rectifier_1_UABH_B_CC_GND_SHIFT)

#define Rectifier_1_UABH_B_FRC_SIGN_BIT_SHIFT           CyUAB_FRC_SIGN_BIT_SHIFT
#define Rectifier_1_UABH_B_FRC_SIGN_BIT_MASK            (1UL<<CyUAB_FRC_SIGN_BIT_SHIFT)

#define Rectifier_1_UABH_B_DAC_MODE_EN_SHIFT            CyUAB_DAC_MODE_EN_SHIFT
#define Rectifier_1_UABH_B_DAC_MODE_EN_MASK             (1UL<<Rectifier_1_UABH_B_DAC_MODE_EN_SHIFT)

#define Rectifier_1_UABH_B_DAC_MODE_SHIFT               CyUAB_DAC_MODE_SHIFT
#define Rectifier_1_UABH_B_DAC_MODE_MASK                (0x3UL<<Rectifier_1_UABH_B_DAC_MODE_SHIFT)
#define Rectifier_1_UABH_B_DAC_MODE_UNSIGNED12          (0UL)
#define Rectifier_1_UABH_B_DAC_MODE_VIRT_SIGNED12       (1UL)
#define Rectifier_1_UABH_B_DAC_MODE_SIGNED13            (2UL)
#define Rectifier_1_UABH_B_DAC_MODE_RESERVED            (3UL)


/*CAP_ABCF_VAL, CAP_AB_VAL_NXT, and CAP_CF_VAL_NXT*/
#define Rectifier_1_UABH_B_CB_VAL_SHIFT                 CyUAB_CB_VAL_SHIFT
#define Rectifier_1_UABH_B_CB_VAL_MASK                  (0x3fUL<<Rectifier_1_UABH_B_CB_VAL_SHIFT)

#define Rectifier_1_UABH_B_CA_VAL_SHIFT                 CyUAB_CA_VAL_SHIFT
#define Rectifier_1_UABH_B_CA_VAL_MASK                  (0x3fUL<<Rectifier_1_UABH_B_CA_VAL_SHIFT)

#define Rectifier_1_UABH_B_SIGN_VAL_SHIFT               CyUAB_SIGN_VAL_SHIFT
#define Rectifier_1_UABH_B_SIGN_VAL_MASK                (1UL<<Rectifier_1_UABH_B_SIGN_VAL_SHIFT)

#define Rectifier_1_UABH_B_CB_64_SHIFT                  CyUAB_CB_64_SHIFT
#define Rectifier_1_UABH_B_CB_64_MASK                   (1UL<<Rectifier_1_UABH_B_CB_64_SHIFT)

#define Rectifier_1_UABH_B_CC_VAL_SHIFT                 CyUAB_CC_VAL_SHIFT
#define Rectifier_1_UABH_B_CC_VAL_MASK                  (0x3fUL<<Rectifier_1_UABH_B_CC_VAL_SHIFT)

#define Rectifier_1_UABH_B_CF_VAL_SHIFT                 CyUAB_CF_VAL_SHIFT
#define Rectifier_1_UABH_B_CF_VAL_MASK                  (0x1fUL<<Rectifier_1_UABH_B_CF_VAL_SHIFT)


/*CAP_CF_VAL_NXT*/
#define Rectifier_1_UABH_B_CC_VAL_UPDATE_SHIFT          CyUAB_CC_VAL_UPDATE_SHIFT
#define Rectifier_1_UABH_B_CC_VAL_UPDATE_MASK           (1UL<<Rectifier_1_UABH_B_CC_VAL_UPDATE_SHIFT)

#define Rectifier_1_UABH_B_CF_VAL_UPDATE_SHIFT          CyUAB_CF_VAL_UPDATE_SHIFT
#define Rectifier_1_UABH_B_CF_VAL_UPDATE_MASK           (1UL<<Rectifier_1_UABH_B_CF_VAL_UPDATE_SHIFT)


/*STARTUP_DELAY*/
#define Rectifier_1_UABH_B_STARTUP_DELAY_SHIFT          CyUAB_STARTUP_DELAY_SHIFT
#define Rectifier_1_UABH_B_STARTUP_DELAY_MASK           (0x0000ffffUL)

#define Rectifier_1_UABH_B_ALIGN_MODE_SHIFT             CyUAB_ALIGN_MODE_SHIFT
#define Rectifier_1_UABH_B_ALIGN_MODE_MASK              (1UL<<Rectifier_1_UABH_B_ALIGN_MODE_SHIFT)


/*SUBSAMPLE_CTRL*/
#define Rectifier_1_UABH_B_SUBSAMPLE_SHIFT              CyUAB_SUBSAMPLE_SHIFT
#define Rectifier_1_UABH_B_SUBSAMPLE_MASK               (0xffUL<<Rectifier_1_UABH_B_SUBSAMPLE_SHIFT)

#define Rectifier_1_UABH_B_SUBSAMPLE_INIT_SHIFT         CyUAB_SUBSAMPLE_INIT_SHIFT
#define Rectifier_1_UABH_B_SUBSAMPLE_INIT_MASK          (0xffUL<<Rectifier_1_UABH_B_SUBSAMPLE_INIT_SHIFT)


/*SW_STATIC*/
#define Rectifier_1_UABH_B_SW_G0_SHIFT                  CyUAB_SW_G0_SHIFT
#define Rectifier_1_UABH_B_SW_G0_MASK                   (1UL<<Rectifier_1_UABH_B_SW_G0_SHIFT)

#define Rectifier_1_UABH_B_SW_G1_SHIFT                  CyUAB_SW_G1_SHIFT
#define Rectifier_1_UABH_B_SW_G1_MASK                   (1UL<<Rectifier_1_UABH_B_SW_G1_SHIFT)

#define Rectifier_1_UABH_B_SW_G2_SHIFT                  CyUAB_SW_G2_SHIFT
#define Rectifier_1_UABH_B_SW_G2_MASK                   (1UL<<Rectifier_1_UABH_B_SW_G2_SHIFT)

#define Rectifier_1_UABH_B_SW_G3_SHIFT                  CyUAB_SW_G3_SHIFT
#define Rectifier_1_UABH_B_SW_G3_MASK                   (1UL<<Rectifier_1_UABH_B_SW_G3_SHIFT)

#define Rectifier_1_UABH_B_SW_RG_SHIFT                  CyUAB_SW_RG_SHIFT
#define Rectifier_1_UABH_B_SW_RG_MASK                   (1UL<<Rectifier_1_UABH_B_SW_RG_SHIFT)

#define Rectifier_1_UABH_B_SW_GG_SHIFT                  CyUAB_SW_GG_SHIFT
#define Rectifier_1_UABH_B_SW_GG_MASK                   (1UL<<Rectifier_1_UABH_B_SW_GG_SHIFT)

#define Rectifier_1_UABH_B_SW_RT_SHIFT                  CyUAB_SW_RT_SHIFT
#define Rectifier_1_UABH_B_SW_RT_MASK                   (1UL<<Rectifier_1_UABH_B_SW_RT_SHIFT)

#define Rectifier_1_UABH_B_SW_GT_SHIFT                  CyUAB_SW_GT_SHIFT
#define Rectifier_1_UABH_B_SW_GT_MASK                   (1UL<<Rectifier_1_UABH_B_SW_GT_SHIFT)

#define Rectifier_1_UABH_B_SW_QT_SHIFT                  CyUAB_SW_QT_SHIFT
#define Rectifier_1_UABH_B_SW_QT_MASK                   (1UL<<Rectifier_1_UABH_B_SW_QT_SHIFT)

#define Rectifier_1_UABH_B_EARLY_PS_SHIFT               CyUAB_EARLY_PS_SHIFT
#define Rectifier_1_UABH_B_EARLY_PS_MASK                (1UL<<Rectifier_1_UABH_B_EARLY_PS_SHIFT)

#define Rectifier_1_UABH_B_EARLY_PO_SHIFT               CyUAB_EARLY_PO_SHIFT
#define Rectifier_1_UABH_B_EARLY_PO_MASK                (1UL<<Rectifier_1_UABH_B_EARLY_PO_SHIFT)

#define Rectifier_1_UABH_B_STRB_RST_SEL_SHIFT           CyUAB_STRB_RST_SEL_SHIFT
#define Rectifier_1_UABH_B_STRB_RST_SEL_MASK            (0x1fUL<<Rectifier_1_UABH_B_STRB_RST_SEL_SHIFT)

#define Rectifier_1_UABH_B_STRB_RST_EN_SHIFT            CyUAB_STRB_RST_EN_SHIFT
#define Rectifier_1_UABH_B_STRB_RST_EN_MASK             (1UL<<Rectifier_1_UABH_B_STRB_RST_EN_SHIFT)


/*SW_MODBIT_SRC*/
#define Rectifier_1_UABH_B_MODBIT0_SRC_SEL_SHIFT        CyUAB_MODBIT0_SRC_SEL_SHIFT
#define Rectifier_1_UABH_B_MODBIT0_SRC_SEL_MASK         (0x1fUL<<Rectifier_1_UABH_B_MODBIT0_SRC_SEL_SHIFT)

#define Rectifier_1_UABH_B_MODBIT1_SRC_SEL_SHIFT        CyUAB_MODBIT1_SRC_SEL_SHIFT
#define Rectifier_1_UABH_B_MODBIT1_SRC_SEL_MASK         (0x1fUL<<Rectifier_1_UABH_B_MODBIT1_SRC_SEL_SHIFT)


/*SW_CA_IN0*/
#define Rectifier_1_UABH_B_SW_A0_MODBIT_SHIFT           CyUAB_SW_A0_MODBIT_SHIFT
#define Rectifier_1_UABH_B_SW_A0_MODBIT_MASK            (0xfUL<<Rectifier_1_UABH_B_SW_A0_MODBIT_SHIFT)

#define Rectifier_1_UABH_B_SW_A1_MODBIT_SHIFT           CyUAB_SW_A1_MODBIT_SHIFT
#define Rectifier_1_UABH_B_SW_A1_MODBIT_MASK            (0xfUL<<Rectifier_1_UABH_B_SW_A1_MODBIT_SHIFT)

#define Rectifier_1_UABH_B_SW_A2_MODBIT_SHIFT           CyUAB_SW_A2_MODBIT_SHIFT
#define Rectifier_1_UABH_B_SW_A2_MODBIT_MASK            (0xfUL<<Rectifier_1_UABH_B_SW_A2_MODBIT_SHIFT)

#define Rectifier_1_UABH_B_SW_A3_MODBIT_SHIFT           CyUAB_SW_A3_MODBIT_SHIFT
#define Rectifier_1_UABH_B_SW_A3_MODBIT_MASK            (0xfUL<<Rectifier_1_UABH_B_SW_A3_MODBIT_SHIFT)

#define Rectifier_1_UABH_B_SW_AP_SHIFT                  CyUAB_SW_AP_SHIFT
#define Rectifier_1_UABH_B_SW_AP_MASK                   (0xfUL<<Rectifier_1_UABH_B_SW_AP_SHIFT)

#define Rectifier_1_UABH_B_SW_AQ_SHIFT                  CyUAB_SW_AQ_SHIFT
#define Rectifier_1_UABH_B_SW_AQ_MASK                   (0xfUL<<Rectifier_1_UABH_B_SW_AQ_SHIFT)

/*SW_CA_IN1*/    
#define Rectifier_1_UABH_B_SW_AA_SHIFT                  CyUAB_SW_AA_SHIFT
#define Rectifier_1_UABH_B_SW_AA_MASK                   (0xfUL<<Rectifier_1_UABH_B_SW_AA_SHIFT)

#define Rectifier_1_UABH_B_SW_AR_MODBIT_SHIFT           CyUAB_SW_AR_MODBIT_SHIFT
#define Rectifier_1_UABH_B_SW_AR_MODBIT_MASK            (0xfUL<<Rectifier_1_UABH_B_SW_AR_MODBIT_SHIFT)

#define Rectifier_1_UABH_B_SW_AG_MODBIT_SHIFT           CyUAB_SW_AG_MODBIT_SHIFT
#define Rectifier_1_UABH_B_SW_AG_MODBIT_MASK            (0xfUL<<Rectifier_1_UABH_B_SW_AG_MODBIT_SHIFT)

#define Rectifier_1_UABH_B_SW_AV_MODBIT_SHIFT           CyUAB_SW_AV_MODBIT_SHIFT
#define Rectifier_1_UABH_B_SW_AV_MODBIT_MASK            (0xfUL<<Rectifier_1_UABH_B_SW_AV_MODBIT_SHIFT)


