ckuzma/cypress-sensor-hub/PSoC Firmware/EnvironmentSensing.cydsn/Generated_Source/PSoC4/Rectifier_1_UABH_B_regs.h
#define Rectifier_1_UABH_B_SW_TC_SHIFT                  CyUAB_SW_TC_SHIFT
#define Rectifier_1_UABH_B_SW_TC_MASK                   (0xfUL<<Rectifier_1_UABH_B_SW_TC_SHIFT)

#define Rectifier_1_UABH_B_SW_SC_SHIFT                  CyUAB_SW_SC_SHIFT
#define Rectifier_1_UABH_B_SW_SC_MASK                   (0xfUL<<Rectifier_1_UABH_B_SW_SC_SHIFT)

#define Rectifier_1_UABH_B_SW_ZC_SHIFT                  CyUAB_SW_ZC_SHIFT
#define Rectifier_1_UABH_B_SW_ZC_MASK                   (0xfUL<<Rectifier_1_UABH_B_SW_ZC_SHIFT)


/*SW_CF_BOT*/
#define Rectifier_1_UABH_B_SW_GF_SHIFT                  CyUAB_SW_GF_SHIFT
#define Rectifier_1_UABH_B_SW_GF_MASK                   (0xfUL<<Rectifier_1_UABH_B_SW_GF_SHIFT)

#define Rectifier_1_UABH_B_SW_PF_SHIFT                  CyUAB_SW_PF_SHIFT
#define Rectifier_1_UABH_B_SW_PF_MASK                   (0xfUL<<Rectifier_1_UABH_B_SW_PF_SHIFT)

#define Rectifier_1_UABH_B_SW_PS_SHIFT                  CyUAB_SW_PS_SHIFT
#define Rectifier_1_UABH_B_SW_PS_MASK                   (0xfUL<<Rectifier_1_UABH_B_SW_PS_SHIFT)

#define Rectifier_1_UABH_B_SW_PO_SHIFT                  CyUAB_SW_PO_SHIFT
#define Rectifier_1_UABH_B_SW_PO_MASK                   (0xfUL<<Rectifier_1_UABH_B_SW_PO_SHIFT)


/*SW_OTHER*/
#define Rectifier_1_UABH_B_CMP_FF_SHIFT                 CyUAB_CMP_FF_SHIFT
#define Rectifier_1_UABH_B_CMP_FF_MASK                  (0xfUL<<Rectifier_1_UABH_B_CMP_FF_SHIFT)

#define Rectifier_1_UABH_B_VALID_SHIFT                  CyUAB_VALID_SHIFT
#define Rectifier_1_UABH_B_VALID_MASK                   (0xfUL<<Rectifier_1_UABH_B_VALID_SHIFT)

#define Rectifier_1_UABH_B_TRIG_OUT_SHIFT               CyUAB_TRIG_OUT_SHIFT
#define Rectifier_1_UABH_B_TRIG_OUT_MASK                (0xfUL<<Rectifier_1_UABH_B_TRIG_OUT_SHIFT)

#define Rectifier_1_UABH_B_STROBE_SW_SHIFT              CyUAB_STROBE_SW_SHIFT
#define Rectifier_1_UABH_B_STROBE_SW_MASK               (0xfUL<<Rectifier_1_UABH_B_STROBE_SW_SHIFT)

#define Rectifier_1_UABH_B_STROBE_RST_SHIFT             CyUAB_STROBE_RST_SHIFT
#define Rectifier_1_UABH_B_STROBE_RST_MASK              (0xfUL<<Rectifier_1_UABH_B_STROBE_RST_SHIFT)


/*SW_BOOST_CTRL*/
#define Rectifier_1_UABH_B_CA_BOOST_SHIFT               CyUAB_CA_BOOST_SHIFT
#define Rectifier_1_UABH_B_CA_BOOST_MASK                (0xfUL<<Rectifier_1_UABH_B_CA_BOOST_SHIFT)

#define Rectifier_1_UABH_B_CB_BOOST_SHIFT               CyUAB_CB_BOOST_SHIFT
#define Rectifier_1_UABH_B_CB_BOOST_MASK                (0xfUL<<Rectifier_1_UABH_B_CB_BOOST_SHIFT)

#define Rectifier_1_UABH_B_CC_BOOST_SHIFT               CyUAB_CC_BOOST_SHIFT
#define Rectifier_1_UABH_B_CC_BOOST_MASK                (0xfUL<<Rectifier_1_UABH_B_CC_BOOST_SHIFT)

#define Rectifier_1_UABH_B_CF_BOOST_SHIFT               CyUAB_CF_BOOST_SHIFT
#define Rectifier_1_UABH_B_CF_BOOST_MASK                (0xfUL<<Rectifier_1_UABH_B_CF_BOOST_SHIFT)

#define Rectifier_1_UABH_B_SUM_BOOST_SHIFT              CyUAB_SUM_BOOST_SHIFT
#define Rectifier_1_UABH_B_SUM_BOOST_MASK               (0xfUL<<Rectifier_1_UABH_B_SUM_BOOST_SHIFT)

#define Rectifier_1_UABH_B_PUMP_WAVE_SHIFT              CyUAB_PUMP_WAVE_SHIFT
#define Rectifier_1_UABH_B_PUMP_WAVE_MASK               (0xfUL<<Rectifier_1_UABH_B_PUMP_WAVE_SHIFT)


/*SRAM_CTRL*/
#define Rectifier_1_UABH_B_LAST_STEP_SHIFT              CyUAB_LAST_STEP_SHIFT
#define Rectifier_1_UABH_B_LAST_STEP_MASK               (0xfUL<<Rectifier_1_UABH_B_LAST_STEP_SHIFT)

#define Rectifier_1_UABH_B_TRIG_SEL_SHIFT               CyUAB_TRIG_SEL_SHIFT
#define Rectifier_1_UABH_B_TRIG_SEL_MASK                (0x1fUL<<Rectifier_1_UABH_B_TRIG_SEL_SHIFT)

#define Rectifier_1_UABH_B_TRIGGER_EN_SHIFT             CyUAB_TRIGGER_EN_SHIFT
#define Rectifier_1_UABH_B_TRIGGER_EN_MASK              (1UL<<Rectifier_1_UABH_B_TRIGGER_EN_SHIFT)

#define Rectifier_1_UABH_B_RUN_SHIFT                    CyUAB_RUN_SHIFT
#define Rectifier_1_UABH_B_RUN_MASK                     (1UL<<Rectifier_1_UABH_B_RUN_SHIFT)


/*STAT*/
#define Rectifier_1_UABH_B_CURR_STEP_SHIFT              CyUAB_CURR_STEP_SHIFT
#define Rectifier_1_UABH_B_CURR_STEP_MASK               (0xfUL<<Rectifier_1_UABH_B_CURR_STEP_SHIFT)

#define Rectifier_1_UABH_B_COMP_SHIFT                   CyUAB_COMP_SHIFT
#define Rectifier_1_UABH_B_COMP_MASK                    (1UL<<Rectifier_1_UABH_B_COMP_SHIFT)

#define Rectifier_1_UABH_B_CURR_SUBSAMPLE_SHIFT         CyUAB_CURR_SUBSAMPLE_SHIFT
#define Rectifier_1_UABH_B_CURR_SUBSAMPLE_MASK          (0xffUL<<Rectifier_1_UABH_B_CURR_SUBSAMPLE_SHIFT)


/*SRAM*/
#define Rectifier_1_UABH_B_WAVE_STEP_SHIFT              CyUAB_WAVE_STEP_SHIFT
#define Rectifier_1_UABH_B_WAVE_STEP_MASK               (0x0000ffffUL)


/*CAP_TRIM*/
#define Rectifier_1_UABH_B_CBTC_VAL_SHIFT               CyUAB_CBTC_VAL_SHIFT
#define Rectifier_1_UABH_B_CBTC_VAL_MASK                (0x7UL<<Rectifier_1_UABH_B_CBTC_VAL_SHIFT)

#define Rectifier_1_UABH_B_CCTC_VAL_SHIFT               CyUAB_CCTC_VAL_SHIFT
#define Rectifier_1_UABH_B_CCTC_VAL_MASK                (0x7UL<<Rectifier_1_UABH_B_CCTC_VAL_SHIFT)


/*OA_TRIM*/
#define Rectifier_1_UABH_B_OA_OFFSET_SHIFT              CyUAB_OA_OFFSET_SHIFT
#define Rectifier_1_UABH_B_OA_OFFSET_MASK               (0xfUL<<Rectifier_1_UABH_B_OA_OFFSET_SHIFT)

#define Rectifier_1_UABH_B_REF_OFFSET_SHIFT             CyUAB_REF_OFFSET_SHIFT
#define Rectifier_1_UABH_B_REF_OFFSET_MASK              (0x1fUL<<Rectifier_1_UABH_B_REF_OFFSET_SHIFT)

#define Rectifier_1_UABH_B_AGND_OFFSET_SHIFT            CyUAB_AGND_OFFSET_SHIFT
#define Rectifier_1_UABH_B_AGND_OFFSET_MASK             (0x1fUL<<Rectifier_1_UABH_B_AGND_OFFSET_SHIFT)



#define Rectifier_1_UABH_B_DAC_NEXT_MASK (CyUAB_DAC_NEXT_MASK)


#endif
